from app.services import localhost_llm
from app.utils import utils
import os


subtitle_prompt = os.path.join(utils.root_dir(), "app","config","subtitle_prompt.md")
with open(subtitle_prompt, 'r', encoding='utf-8') as f:
    md_content = f.read()

content = """
1
00:00:00,000 --> 00:00:02,460
没想到村口的大妈们竟是世界上最牛的情报组织
        
2
00:00:02,460 --> 00:00:03,700
连狗路过都能身败名裂
        
3
00:00:03,700 --> 00:00:04,880
就比如眼前这位小姐姐
        
4
00:00:04,880 --> 00:00:05,840
我先回家探望父母
        
5
00:00:05,840 --> 00:00:06,940
当时小姐长胖了不少
        
6
00:00:06,940 --> 00:00:08,039
路过村口情报站后
        
7
00:00:08,039 --> 00:00:09,320
那群大妈就开始讨论自己
        
8
00:00:09,320 --> 00:00:11,080
但小姐也没当回事的继续往家里走
        
9
00:00:11,080 --> 00:00:11,720
等到第二天
        
10
00:00:11,720 --> 00:00:12,540
村里就传开了
        
11
00:00:12,540 --> 00:00:13,820
说小姐在外面未婚先孕了
        
12
00:00:13,820 --> 00:00:15,020
这是回家准备办喜事呢
        
13
00:00:15,020 --> 00:00:16,079
小姐听说后期的不行
        
14
00:00:16,079 --> 00:00:17,620
明明自己还是黄花大闺女了
        
15
00:00:17,620 --> 00:00:18,740
但一想到过年还要回家
        
16
00:00:18,740 --> 00:00:20,020
到时候谣言就不攻自破了
        
17
00:00:20,020 --> 00:00:21,500
然后小姐就开始努力减肥
        
18
00:00:30,000 --> 00:00:31,160
因为平常有着晨跑的习惯
        
19
00:00:31,160 --> 00:00:32,360
所以每天都早早的起床
        
20
00:00:32,360 --> 00:00:33,380
出去沿着村跑一圈
        
21
00:00:33,380 --> 00:00:34,760
刚开始觉得村里的空气太好了
        
22
00:00:34,760 --> 00:00:35,680
晨爬非常舒服
        
23
00:00:35,680 --> 00:00:37,540
怎料没多久村口大妈们就开始传闲话
        
24
00:00:37,540 --> 00:00:38,520
说小姐姐天天早上
        
25
00:00:38,520 --> 00:00:39,500
不知道从谁家跑出来
        
26
00:00:39,500 --> 00:00:41,300
还说小解姐在村里搞了好几个小男朋友
        
27
00:00:41,300 --> 00:00:42,480
小姐解听说后都气笑了
        
28
00:00:42,480 --> 00:00:43,540
就把晨考改成了夜跑
        
29
00:00:43,540 --> 00:00:44,640
结果又传出她天天晚上
        
30
00:00:44,640 --> 00:00:45,980
去不同的男生家里留宿
        
31
00:00:45,980 --> 00:00:47,220
然后白天再跑回自己家
        
32
00:00:47,220 --> 00:00:47,740
好家伙
        
33
00:00:47,740 --> 00:00:48,700
这误会是越来越深了
        
34
00:00:48,700 --> 00:00:49,260
不仅如此
        
35
00:00:49,260 --> 00:00:49,960
还有网友表示
        
36
00:00:49,960 --> 00:00:51,220
她现在回家都绕山路走
        
37
00:00:51,220 --> 00:00:52,740
压登不敢经过村口的情报组织
        
38
00:00:52,740 --> 00:00:53,700
怎料荒废了几年的山
        
39
00:00:53,700 --> 00:00:54,940
直接被网友走出来一条路
        
40
00:00:54,940 --> 00:00:56,440
而且在外地打工的其他人知道后
        
41
00:00:56,440 --> 00:00:57,460
因为都不想身败名利
        
42
00:00:57,460 --> 00:00:58,880
所以每年回家也都走这条路
"""

if __name__ == '__main__':
    localhost_llm.call_llm_get_list("http://localhost:1234/v1","lm-studio","qwen3-14b",md_content,content,0.7,3)
